# Ultralytics YOLO 🚀, AGPL-3.0 license
nc: 7  # 注意：你的数据集是7类，这里原配置是80，必须修改！
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 修正后Backbone（确保通道传递一致）
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 → 输出64
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 → 输出128（输入64）
  - [-1, 2, CSP_PMSFA, [128, True]] # 2 → 输入128，输出128（残差通道匹配）
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8 → 输出256（输入128）
  - [-1, 2, CSP_PMSFA, [256, True]] # 4 → 输入256，输出256（残差匹配）
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 → 输出512（输入256）
  - [-1, 2, CSP_PMSFA, [512, True]] # 6 → 输入512，输出512（残差匹配）
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 → 输出1024（输入512）
  - [-1, 2, CSP_PMSFA, [1024, True]] # 8 → 输入1024，输出1024（残差匹配）
  - [-1, 1, SPPF, [1024, 5]] # 9 → 输出1024
  - [-1, 2, C2PSA, [1024]] # 10 → 输出1024

# 修正后Head（确保Concat后通道与模块匹配）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 → 输入1024，输出1024（尺寸翻倍）
  - [[-1, 6], 1, Concat, [1]] # 12 → 拼接1024（第11层）+512（第6层）=1536
  - [-1, 2, CSP_PMSFA, [512]] # 13 → 输入1536，输出512（模块内部需将1536调整为512）

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 → 输入512，输出512
  - [[-1, 4], 1, Concat, [1]] # 15 → 拼接512（第14层）+256（第4层）=768
  - [-1, 2, CSP_PMSFA, [256]] # 16 → 输入768，输出256（模块内部调整）

  - [-1, 1, Conv, [256, 3, 2]] # 17 → 输入256，输出256
  - [[-1, 13], 1, Concat, [1]] # 18 → 拼接256（第17层）+512（第13层）=768
  - [-1, 2, CSP_PMSFA, [512]] # 19 → 输入768，输出512

  - [-1, 1, Conv, [512, 3, 2]] # 20 → 输入512，输出512
  - [[-1, 10], 1, Concat, [1]] # 21 → 拼接512（第20层）+1024（第10层）=1536
  - [-1, 2, CSP_PMSFA, [1024]] # 22 → 输入1536，输出1024

  - [[4, 16], 1, CGAFusion, []] # 23 → 输入256（第4层）+256（第16层）
  - [[6, 19], 1, CGAFusion, []] # 24 → 输入512（第6层）+512（第19层）
  - [[10, 22], 1, CGAFusion, []] # 25 → 输入1024（第10层）+1024（第22层）

  - [[23, 24, 25], 1, Detect, [nc]] # 检测头，输入通道匹配