nc: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

#____________________________________________
# ---------------- BACKBONE ----------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0
  - [-1, 1, Conv, [128, 3, 2]]        # 1
  - [-1, 2, C3k2, [256, False, 0.5]]  # 2  (richer early features)

  # ✅ P2 feature (stride 4)
  - [2, 1, Conv, [128, 1, 1]]         # 3 (P2)

  - [-2, 1, Conv, [256, 3, 2]]        # 4 (P3)
  - [-1, 2, C3k2, [512, False, 0.5]]  # 5
  - [-1, 1, Conv, [512, 3, 2]]        # 6 (P4)
  - [-1, 2, C3k2, [512, True]]        # 7
  - [-1, 1, Conv, [1024, 3, 2]]       # 8 (P5)
  - [-1, 2, C3k2, [1024, True]]       # 9

  # ✅ larger receptive field
  - [-1, 1, SPPF, [1024, 9]]          # 10
  - [-1, 2, C2PSA, [1024]]            # 11

# ---------------- HEAD ----------------
head:
  # ---- P5 → P4 ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 7], 1, Concat, [1]]                   # 13
  - [-1, 2, C3k2, [512, False]]                # 14 (P4)

  # ---- P4 → P3 ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15

  # SPDConv branch (from early high-res)
  - [2, 1, SPDConv, [256]]                     # 16
  - [-1, 1, Conv, [256, 1, 1]]                # 17 ✅ projection fix

  # ✅ FIX: Properly fuses top-down P4 (15) with bottom-up SPDConv projection (17)
  - [[15, 17], 1, Concat, [1]]                # 18 
  - [-1, 2, C3k2, [256, False]]              # 19 (P3)

  # ---- P3 → P2 ---- (NEW)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 3], 1, Concat, [1]]                 # 21
  - [-1, 2, C3k2, [128, False]]              # 22 (P2)

  # ---- P2 → P3 ----
  - [-1, 1, Conv, [128, 3, 2]]               # 23
  - [[-1, 19], 1, Concat, [1]]              # 24
  - [-1, 2, C3k2, [256, False]]            # 25 (P3 refined)

  # ---- P3 → P4 ----
  - [-1, 1, Conv, [256, 3, 2]]             # 26
  - [[-1, 14], 1, Concat, [1]]            # 27
  - [-1, 2, C3k2, [512, False]]          # 28 (P4 refined)

  # ---- P4 → P5 ----
  - [-1, 1, Conv, [512, 3, 2]]           # 29
  - [[-1, 11], 1, Concat, [1]]          # 30
  - [-1, 2, C3k2, [1024, True]]        # 31 (P5 refined)

  # ---- Detect (4-scale) ----
  - [[22, 25, 28, 31], 1, Detect, [nc]]  # P2, P3, P4, P5